package com.never;
/**
 * @author 봉준
 * 
 * >> 폴더 분류 기준 <<  
 * 
 * /data/
 * 		각자 성에 따라 분류한 개인 패키지.
 * 		해당 위치에서 개인 작업 하시면됩니다.
 * 
 * /project/
 * 		개인 작업하다가 합쳐질 패키지.
 * 		일정 시간 진척이 생기면 머지해서 합쳐진 결과물을 보여줍니다.
 * 		하지만 우리 작업이 병행되는 부분이 너무 많아서
 * 		이 부분은 네 명이 다 모였을 때 같이 수정해야 합니다.
 * 
 * /share/
 * 		공통적으로 사용하거나 친목 도모용 패키지.
 * 		같이 봐서 좋은 문서라던가 사진 같은 것들을 공유합니다.

 * 
 * >> 지켜주세요. <<
 * 
 * 작업하는 브랜치(branch)는 master 입니다.
 * 각자 자신의 패키지에서 작업을 합니다.
 * commit은  최대 1시간 간격으로 알아서 하시면됩니다. 단, 즉시 remote에 push를 합니다.
 * 절대 다른 사람이 작업하는 패키지나 파일에는 동의 없이 접근하시면 안됩니다.
 * 각자 소스는 만약의 경우를 대비해서 항상 백업합니다.
 * pull -> commit -> push 이 순서대로만 진행하시면 패키지가 구분되어 있어서 문제가 없습니다.
 * 뭔가 찜찜하면 무조건 pull을 하고 나머지 작업을 하시면 됩니다.
 * 
*****여기까지 읽고 이해가 안되시는 분은 반드시 재문의 바랍니다. * 
 * 
 * 
 * 
**/